Revit 2017 API
StructuralSectionLProfile Class
 Defines parameters for L profile structural section.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
public class StructuralSectionLProfile : StructuralSectionColdFormed
Visual Basic
Public Class StructuralSectionLProfile _
	Inherits StructuralSectionColdFormed
Visual C++
public ref class StructuralSectionLProfile : public StructuralSectionColdFormed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionColdFormed
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLProfile
See Also
StructuralSectionLProfile Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace